Versión servicios con BD/AplicacionTuLibroOnline/src/jbiServiceUnits/AplicacionTuLibroOnline.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="AplicacionTuLibroOnline"
             xmlns:tns="AplicacionTuLibroOnline" xmlns:ns="http://j2ee.netbeans.org/wsdl/ServiciosVenta/src/VentaLibrosWSDL" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/ServiciosVenta/src/VentaLibrosWSDL" location="../jbiServiceUnits/ServiciosVenta/DescriptorBPEL/VentaLibrosWSDL.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:VentaLibrosWSDLPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="VentaLibrosWSDLOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="AplicacionTuLibroOnline"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="AplicacionTuLibroOnline"/>
            </output>
        </operation>
    </binding>
    <service name="AplicacionTuLibroOnlineService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/AplicacionTuLibroOnlineService1/casaPort1"/>
        </port>
    </service>
</definitions>
