Versión loopBack/AplicacionTuLibroOnline/test/TestCase2/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:apl="AplicacionTuLibroOnline">
  <soapenv:Body>
    <apl:VentaLibrosWSDLOperation>
      <ISBN>dsf</ISBN>
      <idCliente>asdadsas</idCliente>
      <unidades>3</unidades>
      <precioUnidad>10</precioUnidad>
    </apl:VentaLibrosWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>