Versión servicios con BD/AplicacionTuLibroOnline/test/StockInsuficiente/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:apl="AplicacionTuLibroOnline">
  <soapenv:Body>
    <apl:VentaLibrosWSDLOperation>
<ISBN>978-0-00-000000-0</ISBN>
      <idCliente>1</idCliente>
      <unidades>100</unidades>
      <precioUnidad>20</precioUnidad>
    </apl:VentaLibrosWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>