Versión servicios con BD/AplicacionTuLibroOnline/test/CasoStockInsuficiente/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:apl="AplicacionTuLibroOnline">
  <soapenv:Body>
    <apl:VentaLibrosWSDLOperation>
      <ISBN>978-0-00-000000-2</ISBN>
      <idCliente>6</idCliente>
      <unidades>400</unidades>
      <precioUnidad>2</precioUnidad>
    </apl:VentaLibrosWSDLOperation>
  </soapenv:Body>
</soapenv:Envelope>